HloModule jit_loss, is_scheduled=true, entry_computation_layout={(f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=5*/f32[256]{0}, f32[256]{0}, f32[256,256]{1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, /*index=10*/f32[256]{0}, f32[4,64,256]{2,1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, f32[4,64]{1,0}, /*index=15*/f32[256,4,64]{2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=20*/f32[256]{0}, f32[256,256]{1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, f32[256]{0}, /*index=25*/f32[4,64,256]{2,1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, /*index=30*/f32[1]{0}, f32[256,1]{1,0}, f32[256]{0}, f32[1728,256]{1,0}, bf16[512,256]{1,0}, /*index=35*/f32[64]{0}, f32[64,64]{1,0}, f32[56,63]{1,0})->(bf16[], f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=5*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256,256]{1,0}, f32[4,64]{1,0}, /*index=10*/f32[256,4,64]{2,1,0}, f32[256]{0}, f32[4,64,256]{2,1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, /*index=15*/f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=20*/f32[256]{0}, f32[256]{0}, f32[256,256]{1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, /*index=25*/f32[256]{0}, f32[4,64,256]{2,1,0}, f32[4,64]{1,0}, f32[256,4,64]{2,1,0}, f32[4,64]{1,0}, /*index=30*/f32[256,4,64]{2,1,0}, f32[1]{0}, f32[256,1]{1,0}, f32[256]{0}, f32[1728,256]{1,0}, /*index=35*/bf16[512,256]{1,0}, f32[64]{0}, f32[64,64]{1,0}, f32[56,63]{1,0})}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="934d5b60df8d01668e6097c87a469e4d"}

%fused_convert (param_0.2: bf16[], param_1.2: bf16[]) -> bf16[] {
  %param_1.2 = bf16[] parameter(1)
  %convert.1389.1 = f32[] convert(bf16[] %param_1.2)
  %param_0.2 = bf16[] parameter(0)
  %convert.1390.1 = f32[] convert(bf16[] %param_0.2)
  %add.184.1 = f32[] add(f32[] %convert.1389.1, f32[] %convert.1390.1), metadata={op_name="jit(loss)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
  ROOT %convert.1392.1 = bf16[] convert(f32[] %add.184.1)
}

%region_18.769 (Arg_0.770.0: bf16[], Arg_1.771.0: bf16[]) -> bf16[] {
  %Arg_1.771.0 = bf16[] parameter(1)
  %Arg_0.770.0 = bf16[] parameter(0)
  ROOT %loop_convert_fusion = bf16[] fusion(bf16[] %Arg_1.771.0, bf16[] %Arg_0.770.0), kind=kLoop, calls=%fused_convert
}

%region_18.769.clone.30 (Arg_0.33.0: f32[], Arg_1.33.0: f32[]) -> f32[] {
  %Arg_1.33.0 = f32[] parameter(1)
  %Arg_0.33.0 = f32[] parameter(0)
  ROOT %add.214.0 = f32[] add(f32[] %Arg_0.33.0, f32[] %Arg_1.33.0), metadata={op_name="jit(loss)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
}

%fused_scatter (param_0.3: bf16[56,63], param_1.3: s32[260,1], param_2.646: f32[216,5,52,63]) -> bf16[56,63] {
  %param_0.3 = bf16[56,63]{1,0} parameter(0)
  %param_1.3 = s32[260,1]{1,0} parameter(1)
  %param_2.646 = f32[216,5,52,63]{3,2,1,0} parameter(2)
  %constant_55_3 = bf16[] constant(0)
  %convert.1640.35 = f32[] convert(bf16[] %constant_55_3)
  %reduce.1398.5 = f32[5,52,63]{2,1,0} reduce(f32[216,5,52,63]{3,2,1,0} %param_2.646, f32[] %convert.1640.35), dimensions={0}, to_apply=%region_18.769.clone.30, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/spec_embed/vmap(vmap(vmap(species_embed)))/reduce_sum[axes=(0,)]" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=36}
  %convert.1612.3 = bf16[5,52,63]{2,1,0} convert(f32[5,52,63]{2,1,0} %reduce.1398.5)
  %bitcast.6817.1 = bf16[260,1,63]{2,0,1} bitcast(bf16[5,52,63]{2,1,0} %convert.1612.3)
  ROOT %scatter.0.1 = bf16[56,63]{1,0} scatter(bf16[56,63]{1,0} %param_0.3, s32[260,1]{1,0} %param_1.3, bf16[260,1,63]{2,0,1} %bitcast.6817.1), update_window_dims={1,2}, inserted_window_dims={}, scatter_dims_to_operand_dims={0}, index_vector_dim=1, to_apply=%region_18.769, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/spec_embed/vmap(vmap(vmap(species_embed)))/species_embed/jit(_take)/scatter-add[update_consts=() dimension_numbers=ScatterDimensionNumbers(update_window_dims=(2,), inserted_window_dims=(0,), scatter_dims_to_operand_dims=(0,)) indices_are_sorted=False unique_indices=False mode=GatherScatterMode.FILL_OR_DROP]" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=36}
}

%region_18.769.clone.23 (Arg_0.26.0: f32[], Arg_1.26.0: f32[]) -> f32[] {
  %Arg_1.26.0 = f32[] parameter(1)
  %Arg_0.26.0 = f32[] parameter(0)
  ROOT %add.186.0 = f32[] add(f32[] %Arg_0.26.0, f32[] %Arg_1.26.0), metadata={op_name="jit(loss)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
}

%fused_reduce (param_0.1304: bf16[52,52], param_1.1399: bf16[52,52]) -> f32[1] {
  %param_1.1399 = bf16[52,52]{1,0} parameter(1)
  %convert.1506.7 = f32[52,52]{1,0} convert(bf16[52,52]{1,0} %param_1.1399)
  %param_0.1304 = bf16[52,52]{1,0} parameter(0)
  %convert.1507.7 = f32[52,52]{1,0} convert(bf16[52,52]{1,0} %param_0.1304)
  %negate.34.7 = f32[52,52]{1,0} negate(f32[52,52]{1,0} %convert.1507.7), metadata={op_name="jit(loss)/jit(main)/neg" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
  %add.248.7 = f32[52,52]{1,0} add(f32[52,52]{1,0} %convert.1506.7, f32[52,52]{1,0} %negate.34.7), metadata={op_name="jit(loss)/jit(main)/add_any" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
  %convert.1586.3 = bf16[52,52]{1,0} convert(f32[52,52]{1,0} %add.248.7)
  %bitcast.6574.7 = bf16[2704]{0} bitcast(bf16[52,52]{1,0} %convert.1586.3)
  %convert.1587.7 = f32[2704]{0} convert(bf16[2704]{0} %bitcast.6574.7)
  %constant_55_28 = bf16[] constant(0)
  %convert.1640.45 = f32[] convert(bf16[] %constant_55_28)
  %reduce.5.5 = f32[] reduce(f32[2704]{0} %convert.1587.7, f32[] %convert.1640.45), dimensions={0}, to_apply=%region_18.769.clone.23, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/reduce_sum[axes=(0,)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %convert.1589.3 = bf16[] convert(f32[] %reduce.5.5)
  %bitcast.6583.1 = bf16[1]{0} bitcast(bf16[] %convert.1589.3)
  ROOT %convert.1590.1 = f32[1]{0} convert(bf16[1]{0} %bitcast.6583.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
}

%fused_convert.1 (param_0.27: bf16[256,256]) -> f32[256,4,64] {
  %param_0.27 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6568.1 = bf16[256,4,64]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.27)
  ROOT %convert.1585.1 = f32[256,4,64]{2,1,0} convert(bf16[256,4,64]{2,1,0} %bitcast.6568.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/value/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.2 (param_0.29: bf16[256,256]) -> f32[256,4,64] {
  %param_0.29 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6539.1 = bf16[256,4,64]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.29)
  ROOT %convert.1581.1 = f32[256,4,64]{2,1,0} convert(bf16[256,4,64]{2,1,0} %bitcast.6539.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/query/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.3 (param_0.31: bf16[256,256]) -> f32[4,64,256] {
  %param_0.31 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6515.1 = bf16[4,64,256]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.31)
  ROOT %convert.1578.1 = f32[4,64,256]{2,1,0} convert(bf16[4,64,256]{2,1,0} %bitcast.6515.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/out/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.4 (param_0.33: bf16[256,256]) -> f32[256,4,64] {
  %param_0.33 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6486.1 = bf16[256,4,64]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.33)
  ROOT %convert.1574.1 = f32[256,4,64]{2,1,0} convert(bf16[256,4,64]{2,1,0} %bitcast.6486.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/key/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%region_2.202 (Arg_0.203.0: f32[], Arg_1.204.0: f32[]) -> f32[] {
  %Arg_1.204.0 = f32[] parameter(1)
  %Arg_0.203.0 = f32[] parameter(0)
  ROOT %add.180.0 = f32[] add(f32[] %Arg_0.203.0, f32[] %Arg_1.204.0), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/reduce_sum[axes=(2,)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%fused_reduce.1 (param_0.1311: bf16[26624,256]) -> f32[208,256] {
  %param_0.1311 = bf16[26624,256]{1,0} parameter(0)
  %convert.1513.1 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1311), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.6411.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1513.1)
  %constant_68_2 = f32[] constant(0)
  ROOT %reduce.86.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.6411.1, f32[] %constant_68_2), dimensions={1}, to_apply=%region_2.202, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_reduce.2 (param_0.1356: bf16[26624,256], param_1.1448: bf16[26624,256]) -> f32[208,256] {
  %param_1.1448 = bf16[26624,256]{1,0} parameter(1)
  %convert.1525.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.1448)
  %param_0.1356 = bf16[26624,256]{1,0} parameter(0)
  %convert.1529.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1356)
  %add.258.5 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1525.5, f32[26624,256]{1,0} %convert.1529.5), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.6386.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.258.5)
  %constant_68_47 = f32[] constant(0)
  ROOT %reduce.82.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.6386.1, f32[] %constant_68_47), dimensions={1}, to_apply=%region_2.202, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%fused_convert.5 (param_0.39: bf16[256,256]) -> f32[256,4,64] {
  %param_0.39 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6380.1 = bf16[256,4,64]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.39)
  ROOT %convert.1566.1 = f32[256,4,64]{2,1,0} convert(bf16[256,4,64]{2,1,0} %bitcast.6380.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/value/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.6 (param_0.41: bf16[256,256]) -> f32[256,4,64] {
  %param_0.41 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6351.1 = bf16[256,4,64]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.41)
  ROOT %convert.1562.1 = f32[256,4,64]{2,1,0} convert(bf16[256,4,64]{2,1,0} %bitcast.6351.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/query/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.7 (param_0.43: bf16[256,256]) -> f32[4,64,256] {
  %param_0.43 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6327.1 = bf16[4,64,256]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.43)
  ROOT %convert.1559.1 = f32[4,64,256]{2,1,0} convert(bf16[4,64,256]{2,1,0} %bitcast.6327.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/out/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.8 (param_0.45: bf16[256,256]) -> f32[256,4,64] {
  %param_0.45 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6298.1 = bf16[256,4,64]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.45)
  ROOT %convert.1555.1 = f32[256,4,64]{2,1,0} convert(bf16[256,4,64]{2,1,0} %bitcast.6298.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/key/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_reduce.3 (param_0.1354: bf16[26624,256]) -> f32[208,256] {
  %param_0.1354 = bf16[26624,256]{1,0} parameter(0)
  %convert.1531.1 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1354), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.6223.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1531.1)
  %constant_68_45 = f32[] constant(0)
  ROOT %reduce.72.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.6223.1, f32[] %constant_68_45), dimensions={1}, to_apply=%region_2.202, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_transpose (param_0.616: bf16[26624,256], param_1.562: bf16[26624,256]) -> f32[512,256,52] {
  %param_1.562 = bf16[26624,256]{1,0} parameter(1)
  %convert.1543.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.562)
  %param_0.616 = bf16[26624,256]{1,0} parameter(0)
  %convert.1547.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.616)
  %add.270.3 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1543.3, f32[26624,256]{1,0} %convert.1547.3), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.6205.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.270.3)
  ROOT %transpose.1222.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.6205.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%fused_reduce.4 (param_0.1352: bf16[26624,256], param_1.1445: bf16[26624,256]) -> f32[208,256] {
  %param_1.1445 = bf16[26624,256]{1,0} parameter(1)
  %convert.1543.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.1445)
  %param_0.1352 = bf16[26624,256]{1,0} parameter(0)
  %convert.1547.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1352)
  %add.270.5 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1543.5, f32[26624,256]{1,0} %convert.1547.5), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.6194.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.270.5)
  %constant_68_43 = f32[] constant(0)
  ROOT %reduce.68.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.6194.1, f32[] %constant_68_43), dimensions={1}, to_apply=%region_2.202, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%region_18.769.clone.5 (Arg_0.8.0: f32[], Arg_1.8.0: f32[]) -> f32[] {
  %Arg_1.8.0 = f32[] parameter(1)
  %Arg_0.8.0 = f32[] parameter(0)
  ROOT %add.187.0 = f32[] add(f32[] %Arg_0.8.0, f32[] %Arg_1.8.0), metadata={op_name="jit(loss)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
}

%fused_reduce_transpose (param_0.59: bf16[208,512,64]) -> (bf16[4,64,52,512], bf16[52,512,4,64], f32[52,4,64]) {
  %param_0.59 = bf16[208,512,64]{2,1,0} parameter(0)
  %bitcast.6149.3 = bf16[52,4,512,64]{3,2,1,0} bitcast(bf16[208,512,64]{2,1,0} %param_0.59)
  %transpose.1224.1 = bf16[4,64,52,512]{3,2,1,0} transpose(bf16[52,4,512,64]{3,2,1,0} %bitcast.6149.3), dimensions={1,3,0,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1219.1.clone.1 = bf16[52,512,4,64]{3,2,1,0} transpose(bf16[52,4,512,64]{3,2,1,0} %bitcast.6149.3), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %convert.1552.3.clone.1 = f32[52,4,512,64]{3,2,1,0} convert(bf16[52,4,512,64]{3,2,1,0} %bitcast.6149.3)
  %constant_55_10_clone_1 = bf16[] constant(0)
  %convert.1640.7.clone.1 = f32[] convert(bf16[] %constant_55_10_clone_1)
  %reduce.56.1.clone.1 = f32[52,4,64]{2,1,0} reduce(f32[52,4,512,64]{3,2,1,0} %convert.1552.3.clone.1, f32[] %convert.1640.7.clone.1), dimensions={2}, to_apply=%region_18.769.clone.5, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/key/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.24 = (bf16[4,64,52,512]{3,2,1,0}, bf16[52,512,4,64]{3,2,1,0}, f32[52,4,64]{2,1,0}) tuple(bf16[4,64,52,512]{3,2,1,0} %transpose.1224.1, bf16[52,512,4,64]{3,2,1,0} %transpose.1219.1.clone.1, f32[52,4,64]{2,1,0} %reduce.56.1.clone.1)
}

%fused_transpose.1 (param_0.67: bf16[208,64,512]) -> (bf16[4,64,52,512], bf16[52,512,4,64]) {
  %param_0.67 = bf16[208,64,512]{2,1,0} parameter(0)
  %bitcast.6081.3 = bf16[52,4,64,512]{3,2,1,0} bitcast(bf16[208,64,512]{2,1,0} %param_0.67)
  %transpose.1227.1 = bf16[4,64,52,512]{3,2,1,0} transpose(bf16[52,4,64,512]{3,2,1,0} %bitcast.6081.3), dimensions={1,2,0,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1217.1.clone.1 = bf16[52,512,4,64]{3,2,1,0} transpose(bf16[52,4,64,512]{3,2,1,0} %bitcast.6081.3), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.25 = (bf16[4,64,52,512]{3,2,1,0}, bf16[52,512,4,64]{3,2,1,0}) tuple(bf16[4,64,52,512]{3,2,1,0} %transpose.1227.1, bf16[52,512,4,64]{3,2,1,0} %transpose.1217.1.clone.1)
}

%fused_transpose.2 (param_0.71: bf16[26624,256]) -> (bf16[52,4,512,64], bf16[52,4,64,512]) {
  %param_0.71 = bf16[26624,256]{1,0} parameter(0)
  %bitcast.6070.2 = bf16[52,512,4,64]{3,2,1,0} bitcast(bf16[26624,256]{1,0} %param_0.71)
  %transpose.1218.1 = bf16[52,4,512,64]{3,2,1,0} transpose(bf16[52,512,4,64]{3,2,1,0} %bitcast.6070.2), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 2, 3, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1216.1.clone.1 = bf16[52,4,64,512]{3,2,1,0} transpose(bf16[52,512,4,64]{3,2,1,0} %bitcast.6070.2), dimensions={0,2,3,1}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/out/dot_general[dimension_numbers=(((2,), (2,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.29 = (bf16[52,4,512,64]{3,2,1,0}, bf16[52,4,64,512]{3,2,1,0}) tuple(bf16[52,4,512,64]{3,2,1,0} %transpose.1218.1, bf16[52,4,64,512]{3,2,1,0} %transpose.1216.1.clone.1)
}

%fused_transpose.3 (param_0.412: bf16[26624,256]) -> f32[512,256,52] {
  %param_0.412 = bf16[26624,256]{1,0} parameter(0)
  %convert.1531.2 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.412), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.5958.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1531.2)
  ROOT %transpose.1214.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5958.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_transpose.4 (param_0.612: bf16[26624,256], param_1.555: bf16[26624,256]) -> f32[512,256,52] {
  %param_1.555 = bf16[26624,256]{1,0} parameter(1)
  %convert.1525.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.555)
  %param_0.612 = bf16[26624,256]{1,0} parameter(0)
  %convert.1529.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.612)
  %add.258.3 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1525.3, f32[26624,256]{1,0} %convert.1529.3), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.5845.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.258.3)
  ROOT %transpose.1212.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5845.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%region_18.769.clone.15 (Arg_0.18.0: f32[], Arg_1.18.0: f32[]) -> f32[] {
  %Arg_1.18.0 = f32[] parameter(1)
  %Arg_0.18.0 = f32[] parameter(0)
  ROOT %add.191.0 = f32[] add(f32[] %Arg_0.18.0, f32[] %Arg_1.18.0), metadata={op_name="jit(loss)/jit(main)/reduce_sum[axes=(1,)]" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=371}
}

%fused_reduce_transpose.1 (param_0.91: bf16[208,512,64]) -> (bf16[4,64,52,512], bf16[52,512,4,64], f32[52,4,64]) {
  %param_0.91 = bf16[208,512,64]{2,1,0} parameter(0)
  %bitcast.5801.3 = bf16[52,4,512,64]{3,2,1,0} bitcast(bf16[208,512,64]{2,1,0} %param_0.91)
  %transpose.1229.1 = bf16[4,64,52,512]{3,2,1,0} transpose(bf16[52,4,512,64]{3,2,1,0} %bitcast.5801.3), dimensions={1,3,0,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1209.1.clone.1 = bf16[52,512,4,64]{3,2,1,0} transpose(bf16[52,4,512,64]{3,2,1,0} %bitcast.5801.3), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %convert.1571.3.clone.1 = f32[52,4,512,64]{3,2,1,0} convert(bf16[52,4,512,64]{3,2,1,0} %bitcast.5801.3)
  %constant_55_20_clone_1 = bf16[] constant(0)
  %convert.1640.17.clone.1 = f32[] convert(bf16[] %constant_55_20_clone_1)
  %reduce.60.1.clone.1 = f32[52,4,64]{2,1,0} reduce(f32[52,4,512,64]{3,2,1,0} %convert.1571.3.clone.1, f32[] %convert.1640.17.clone.1), dimensions={2}, to_apply=%region_18.769.clone.15, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/key/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.37 = (bf16[4,64,52,512]{3,2,1,0}, bf16[52,512,4,64]{3,2,1,0}, f32[52,4,64]{2,1,0}) tuple(bf16[4,64,52,512]{3,2,1,0} %transpose.1229.1, bf16[52,512,4,64]{3,2,1,0} %transpose.1209.1.clone.1, f32[52,4,64]{2,1,0} %reduce.60.1.clone.1)
}

%fused_transpose.5 (param_0.99: bf16[208,64,512]) -> (bf16[4,64,52,512], bf16[52,512,4,64]) {
  %param_0.99 = bf16[208,64,512]{2,1,0} parameter(0)
  %bitcast.5732.3 = bf16[52,4,64,512]{3,2,1,0} bitcast(bf16[208,64,512]{2,1,0} %param_0.99)
  %transpose.1233.1 = bf16[4,64,52,512]{3,2,1,0} transpose(bf16[52,4,64,512]{3,2,1,0} %bitcast.5732.3), dimensions={1,2,0,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1207.1.clone.1 = bf16[52,512,4,64]{3,2,1,0} transpose(bf16[52,4,64,512]{3,2,1,0} %bitcast.5732.3), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.38 = (bf16[4,64,52,512]{3,2,1,0}, bf16[52,512,4,64]{3,2,1,0}) tuple(bf16[4,64,52,512]{3,2,1,0} %transpose.1233.1, bf16[52,512,4,64]{3,2,1,0} %transpose.1207.1.clone.1)
}

%fused_transpose.6 (param_0.103: bf16[26624,256]) -> (bf16[52,4,512,64], bf16[52,4,64,512]) {
  %param_0.103 = bf16[26624,256]{1,0} parameter(0)
  %bitcast.5721.2 = bf16[52,512,4,64]{3,2,1,0} bitcast(bf16[26624,256]{1,0} %param_0.103)
  %transpose.1208.1 = bf16[52,4,512,64]{3,2,1,0} transpose(bf16[52,512,4,64]{3,2,1,0} %bitcast.5721.2), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 2, 3, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1206.1.clone.1 = bf16[52,4,64,512]{3,2,1,0} transpose(bf16[52,512,4,64]{3,2,1,0} %bitcast.5721.2), dimensions={0,2,3,1}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/out/dot_general[dimension_numbers=(((2,), (2,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.42 = (bf16[52,4,512,64]{3,2,1,0}, bf16[52,4,64,512]{3,2,1,0}) tuple(bf16[52,4,512,64]{3,2,1,0} %transpose.1208.1, bf16[52,4,64,512]{3,2,1,0} %transpose.1206.1.clone.1)
}

%fused_transpose.7 (param_0.413: bf16[26624,256]) -> f32[512,256,52] {
  %param_0.413 = bf16[26624,256]{1,0} parameter(0)
  %convert.1513.2 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.413), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.5607.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1513.2)
  ROOT %transpose.1204.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5607.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_reduce.5 (param_0.1331: f32[52,52]) -> f32[] {
  %param_0.1331 = f32[52,52]{1,0} parameter(0)
  %bitcast.5388.1 = f32[2704]{0} bitcast(f32[52,52]{1,0} %param_0.1331)
  %constant_68_22 = f32[] constant(0)
  ROOT %reduce.757.1 = f32[] reduce(f32[2704]{0} %bitcast.5388.1, f32[] %constant_68_22), dimensions={0}, to_apply=%region_2.202, metadata={op_name="jit(loss)/jit(main)/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=372}
}

%fused_multiply_rsqrt (param_0.1391: f32[512,52], param_1.1536: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1391 = f32[512,52]{1,0} parameter(0)
  %constant_35_20 = f32[] constant(0.00390625)
  %broadcast.555.43 = f32[512,52]{1,0} broadcast(f32[] %constant_35_20), dimensions={}
  %multiply.346.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1391, f32[512,52]{1,0} %broadcast.555.43), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %param_1.1536 = f32[512,52]{1,0} parameter(1)
  %multiply.344.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1536, f32[512,52]{1,0} %broadcast.555.43), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %multiply.347.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.344.1.clone.1, f32[512,52]{1,0} %multiply.344.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %subtract.39.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.346.5, f32[512,52]{1,0} %multiply.347.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %constant_68_53 = f32[] constant(0)
  %broadcast.557.49 = f32[512,52]{1,0} broadcast(f32[] %constant_68_53), dimensions={}
  %maximum.20.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.39.3, f32[512,52]{1,0} %broadcast.557.49), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %constant_64_1 = f32[] constant(1e-06)
  %broadcast.558.9 = f32[512,52]{1,0} broadcast(f32[] %constant_64_1), dimensions={}
  %add.241.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.20.11, f32[512,52]{1,0} %broadcast.558.9), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %bitcast.5306.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.241.5)
  %rsqrt.14.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.5306.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  ROOT %tuple.54 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.14.1, f32[512,52]{1,0} %multiply.344.1.clone.1)
}

%fused_multiply_rsqrt.1 (param_0.1392: f32[512,52], param_1.1538: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1392 = f32[512,52]{1,0} parameter(0)
  %constant_35_19 = f32[] constant(0.00390625)
  %broadcast.555.39 = f32[512,52]{1,0} broadcast(f32[] %constant_35_19), dimensions={}
  %multiply.340.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1392, f32[512,52]{1,0} %broadcast.555.39), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %param_1.1538 = f32[512,52]{1,0} parameter(1)
  %multiply.337.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1538, f32[512,52]{1,0} %broadcast.555.39), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %multiply.341.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.337.1.clone.1, f32[512,52]{1,0} %multiply.337.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %subtract.37.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.340.5, f32[512,52]{1,0} %multiply.341.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_68_52 = f32[] constant(0)
  %broadcast.557.53 = f32[512,52]{1,0} broadcast(f32[] %constant_68_52), dimensions={}
  %maximum.19.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.37.3, f32[512,52]{1,0} %broadcast.557.53), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_64_5 = f32[] constant(1e-06)
  %broadcast.558.13 = f32[512,52]{1,0} broadcast(f32[] %constant_64_5), dimensions={}
  %add.237.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.19.11, f32[512,52]{1,0} %broadcast.558.13), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.5222.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.237.5)
  %rsqrt.13.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.5222.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  ROOT %tuple.56 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.13.1, f32[512,52]{1,0} %multiply.337.1.clone.1)
}

%fused_transpose.8 (param_0.139: bf16[208,64,512]) -> bf16[52,512,4,64] {
  %param_0.139 = bf16[208,64,512]{2,1,0} parameter(0)
  %bitcast.5148.1 = bf16[52,4,64,512]{3,2,1,0} bitcast(bf16[208,64,512]{2,1,0} %param_0.139)
  ROOT %transpose.1198.1 = bf16[52,512,4,64]{3,2,1,0} transpose(bf16[52,4,64,512]{3,2,1,0} %bitcast.5148.1), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_multiply_rsqrt.2 (param_0.1393: f32[512,52], param_1.1540: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1393 = f32[512,52]{1,0} parameter(0)
  %constant_35_18 = f32[] constant(0.00390625)
  %broadcast.555.35 = f32[512,52]{1,0} broadcast(f32[] %constant_35_18), dimensions={}
  %multiply.330.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1393, f32[512,52]{1,0} %broadcast.555.35), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %param_1.1540 = f32[512,52]{1,0} parameter(1)
  %multiply.328.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1540, f32[512,52]{1,0} %broadcast.555.35), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %multiply.331.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.328.1.clone.1, f32[512,52]{1,0} %multiply.328.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %subtract.34.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.330.5, f32[512,52]{1,0} %multiply.331.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %constant_68_51 = f32[] constant(0)
  %broadcast.557.57 = f32[512,52]{1,0} broadcast(f32[] %constant_68_51), dimensions={}
  %maximum.18.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.34.3, f32[512,52]{1,0} %broadcast.557.57), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %constant_64_4 = f32[] constant(1e-06)
  %broadcast.558.17 = f32[512,52]{1,0} broadcast(f32[] %constant_64_4), dimensions={}
  %add.229.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.18.11, f32[512,52]{1,0} %broadcast.558.17), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %bitcast.5026.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.229.5)
  %rsqrt.12.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.5026.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  ROOT %tuple.59 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.12.1, f32[512,52]{1,0} %multiply.328.1.clone.1)
}

%fused_multiply_rsqrt.3 (param_0.1394: f32[512,52], param_1.1542: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1394 = f32[512,52]{1,0} parameter(0)
  %constant_35_17 = f32[] constant(0.00390625)
  %broadcast.555.31 = f32[512,52]{1,0} broadcast(f32[] %constant_35_17), dimensions={}
  %multiply.324.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1394, f32[512,52]{1,0} %broadcast.555.31), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %param_1.1542 = f32[512,52]{1,0} parameter(1)
  %multiply.322.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1542, f32[512,52]{1,0} %broadcast.555.31), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %multiply.325.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.322.1.clone.1, f32[512,52]{1,0} %multiply.322.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %subtract.32.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.324.5, f32[512,52]{1,0} %multiply.325.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_68_49 = f32[] constant(0)
  %broadcast.557.65 = f32[512,52]{1,0} broadcast(f32[] %constant_68_49), dimensions={}
  %maximum.17.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.32.3, f32[512,52]{1,0} %broadcast.557.65), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_64_2 = f32[] constant(1e-06)
  %broadcast.558.25 = f32[512,52]{1,0} broadcast(f32[] %constant_64_2), dimensions={}
  %add.225.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.17.11, f32[512,52]{1,0} %broadcast.558.25), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.4942.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.225.5)
  %rsqrt.11.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.4942.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  ROOT %tuple.61 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.11.1, f32[512,52]{1,0} %multiply.322.1.clone.1)
}

%fused_transpose.9 (param_0.163: bf16[208,64,512]) -> bf16[52,512,4,64] {
  %param_0.163 = bf16[208,64,512]{2,1,0} parameter(0)
  %bitcast.4868.1 = bf16[52,4,64,512]{3,2,1,0} bitcast(bf16[208,64,512]{2,1,0} %param_0.163)
  ROOT %transpose.1187.1 = bf16[52,512,4,64]{3,2,1,0} transpose(bf16[52,4,64,512]{3,2,1,0} %bitcast.4868.1), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_multiply_rsqrt.4 (param_0.1395: f32[512,52], param_1.1544: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1395 = f32[512,52]{1,0} parameter(0)
  %constant_35_16 = f32[] constant(0.00390625)
  %broadcast.555.27 = f32[512,52]{1,0} broadcast(f32[] %constant_35_16), dimensions={}
  %multiply.317.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1395, f32[512,52]{1,0} %broadcast.555.27), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %param_1.1544 = f32[512,52]{1,0} parameter(1)
  %multiply.314.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1544, f32[512,52]{1,0} %broadcast.555.27), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %multiply.318.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.314.1.clone.1, f32[512,52]{1,0} %multiply.314.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %subtract.29.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.317.5, f32[512,52]{1,0} %multiply.318.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %constant_68_50 = f32[] constant(0)
  %broadcast.557.61 = f32[512,52]{1,0} broadcast(f32[] %constant_68_50), dimensions={}
  %maximum.16.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.29.3, f32[512,52]{1,0} %broadcast.557.61), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %constant_64_3 = f32[] constant(1e-06)
  %broadcast.558.21 = f32[512,52]{1,0} broadcast(f32[] %constant_64_3), dimensions={}
  %add.218.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.16.11, f32[512,52]{1,0} %broadcast.558.21), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %bitcast.4747.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.218.5)
  %rsqrt.10.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.4747.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  ROOT %tuple.64 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.10.1, f32[512,52]{1,0} %multiply.314.1.clone.1)
}

%fused_transpose.10 (param_0.663: f32[256], param_1.619: bf16[26624,256]) -> bf16[512,256,52] {
  %param_1.619 = bf16[26624,256]{1,0} parameter(1)
  %convert.1403.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.619)
  %param_0.663 = f32[256]{0} parameter(0)
  %broadcast.653.5 = f32[26624,256]{1,0} broadcast(f32[256]{0} %param_0.663), dimensions={1}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/im_embed/vmap(inner)/vmap(Patchify_0)/patch_proj/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=40}
  %add.216.5 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1403.3, f32[26624,256]{1,0} %broadcast.653.5), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/im_embed/vmap(inner)/vmap(Patchify_0)/patch_proj/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=40}
  %convert.1406.3 = bf16[26624,256]{1,0} convert(f32[26624,256]{1,0} %add.216.5)
  %bitcast.4690.1 = bf16[52,512,256]{2,1,0} bitcast(bf16[26624,256]{1,0} %convert.1406.3)
  ROOT %transpose.1182.1 = bf16[512,256,52]{2,1,0} transpose(bf16[52,512,256]{2,1,0} %bitcast.4690.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/im_embed/vmap(inner)/vmap(Patchify_0)/patch_proj/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=40}
}

%fused_transpose.11 (param_0.1317: f32[64], param_1.1416: bf16[3594240,64], param_2.848: bf16[5,52]) -> bf16[52,8,8,8,3,3,3,64] {
  %param_1.1416 = bf16[3594240,64]{1,0} parameter(1)
  %convert.1395.7 = f32[3594240,64]{1,0} convert(bf16[3594240,64]{1,0} %param_1.1416)
  %param_0.1317 = f32[64]{0} parameter(0)
  %broadcast.650.9 = f32[3594240,64]{1,0} broadcast(f32[64]{0} %param_0.1317), dimensions={1}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/spec_embed/vmap(vmap(vmap(species_embed)))/embed_module/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %add.215.9 = f32[3594240,64]{1,0} add(f32[3594240,64]{1,0} %convert.1395.7, f32[3594240,64]{1,0} %broadcast.650.9), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/spec_embed/vmap(vmap(vmap(species_embed)))/embed_module/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %convert.1398.7 = bf16[3594240,64]{1,0} convert(f32[3594240,64]{1,0} %add.215.9)
  %bitcast.4661.7 = bf16[13824,5,52,64]{3,2,1,0} bitcast(bf16[3594240,64]{1,0} %convert.1398.7)
  %convert.1399.7 = f32[13824,5,52,64]{3,2,1,0} convert(bf16[13824,5,52,64]{3,2,1,0} %bitcast.4661.7)
  %param_2.848 = bf16[5,52]{1,0} parameter(2)
  %convert.1615.2 = f32[5,52]{1,0} convert(bf16[5,52]{1,0} %param_2.848)
  %broadcast.652.10 = f32[13824,5,52,64]{3,2,1,0} broadcast(f32[5,52]{1,0} %convert.1615.2), dimensions={1,2}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/spec_embed/vmap(vmap(vmap(species_embed)))/mul" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=37}
  %multiply.313.7 = f32[13824,5,52,64]{3,2,1,0} multiply(f32[13824,5,52,64]{3,2,1,0} %convert.1399.7, f32[13824,5,52,64]{3,2,1,0} %broadcast.652.10), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/spec_embed/vmap(vmap(vmap(species_embed)))/mul" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=37}
  %constant_68_8 = f32[] constant(0)
  %reduce.6.5 = f32[13824,52,64]{2,1,0} reduce(f32[13824,5,52,64]{3,2,1,0} %multiply.313.7, f32[] %constant_68_8), dimensions={1}, to_apply=%region_2.202, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/spec_embed/reduce_sum[axes=(3,)]" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=56}
  %convert.1401.3 = bf16[13824,52,64]{2,1,0} convert(f32[13824,52,64]{2,1,0} %reduce.6.5), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/spec_embed/convert_element_type[new_dtype=bfloat16 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=56}
  %bitcast.4672.1 = bf16[8,3,8,3,8,3,52,64]{7,6,5,4,3,2,1,0} bitcast(bf16[13824,52,64]{2,1,0} %convert.1401.3)
  ROOT %transpose.1181.1 = bf16[52,8,8,8,3,3,3,64]{7,6,5,4,3,2,1,0} transpose(bf16[8,3,8,3,8,3,52,64]{7,6,5,4,3,2,1,0} %bitcast.4672.1), dimensions={6,0,2,4,1,3,5,7}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/im_embed/vmap(inner)/transpose[permutation=(0, 1, 3, 5, 2, 4, 6, 7)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=103}
}

%fused_convert.9 (param_0.625: bf16[26624,1728], param_1.576: bf16[5,52]) -> bf16[13824,5,52,64] {
  %param_0.625 = bf16[26624,1728]{1,0} parameter(0)
  %bitcast.6750.3 = bf16[52,8,8,8,3,3,3,64]{7,6,5,4,3,2,1,0} bitcast(bf16[26624,1728]{1,0} %param_0.625)
  %transpose.1237.3 = bf16[8,3,8,3,8,3,52,64]{7,6,5,4,3,2,1,0} transpose(bf16[52,8,8,8,3,3,3,64]{7,6,5,4,3,2,1,0} %bitcast.6750.3), dimensions={1,4,2,5,3,6,0,7}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/im_embed/vmap(inner)/vmap(Patchify_0)/patch_proj/dot_general[dimension_numbers=(((2,), (1,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=40}
  %bitcast.6753.6 = bf16[13824,52,64]{2,1,0} bitcast(bf16[8,3,8,3,8,3,52,64]{7,6,5,4,3,2,1,0} %transpose.1237.3)
  %convert.1650.3 = f32[13824,52,64]{2,1,0} convert(bf16[13824,52,64]{2,1,0} %bitcast.6753.6)
