HloModule jit_loss, is_scheduled=true, entry_computation_layout={(f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=5*/f32[256]{0}, f32[256]{0}, f32[256,256]{1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, /*index=10*/f32[256]{0}, f32[8,32,256]{2,1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, f32[8,32]{1,0}, /*index=15*/f32[256,8,32]{2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=20*/f32[256]{0}, f32[256,256]{1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, f32[256]{0}, /*index=25*/f32[8,32,256]{2,1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, /*index=30*/f32[1]{0}, f32[256,1]{1,0}, f32[256]{0}, f32[1728,256]{1,0}, bf16[512,256]{1,0}, /*index=35*/f32[56,64]{1,0})->(bf16[], f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=5*/f32[256]{0}, f32[256]{0}, f32[256]{0}, f32[256,256]{1,0}, f32[8,32]{1,0}, /*index=10*/f32[256,8,32]{2,1,0}, f32[256]{0}, f32[8,32,256]{2,1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, /*index=15*/f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, f32[256]{0}, f32[256]{0}, f32[256]{0}, /*index=20*/f32[256]{0}, f32[256]{0}, f32[256,256]{1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, /*index=25*/f32[256]{0}, f32[8,32,256]{2,1,0}, f32[8,32]{1,0}, f32[256,8,32]{2,1,0}, f32[8,32]{1,0}, /*index=30*/f32[256,8,32]{2,1,0}, f32[1]{0}, f32[256,1]{1,0}, f32[256]{0}, f32[1728,256]{1,0}, /*index=35*/bf16[512,256]{1,0}, f32[56,64]{1,0})}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, frontend_attributes={fingerprint_before_lhs="969cd50f026cde036289fbde43843964"}

%fused_convert (param_0.2: bf16[], param_1.2: bf16[]) -> bf16[] {
  %param_1.2 = bf16[] parameter(1)
  %convert.1320.1 = f32[] convert(bf16[] %param_1.2)
  %param_0.2 = bf16[] parameter(0)
  %convert.1321.1 = f32[] convert(bf16[] %param_0.2)
  %add.169.1 = f32[] add(f32[] %convert.1320.1, f32[] %convert.1321.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/vmap(vmap(LazyInMLP_0))/Dense_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  ROOT %convert.1322.1 = bf16[] convert(f32[] %add.169.1)
}

%region_26.806 (Arg_0.807.0: bf16[], Arg_1.808.0: bf16[]) -> bf16[] {
  %Arg_1.808.0 = bf16[] parameter(1)
  %Arg_0.807.0 = bf16[] parameter(0)
  ROOT %loop_convert_fusion = bf16[] fusion(bf16[] %Arg_1.808.0, bf16[] %Arg_0.807.0), kind=kLoop, calls=%fused_convert
}

%region_26.806.clone.27 (Arg_0.30.0: f32[], Arg_1.30.0: f32[]) -> f32[] {
  %Arg_1.30.0 = f32[] parameter(1)
  %Arg_0.30.0 = f32[] parameter(0)
  ROOT %add.197.0 = f32[] add(f32[] %Arg_0.30.0, f32[] %Arg_1.30.0), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/vmap(vmap(LazyInMLP_0))/Dense_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
}

%fused_scatter (param_0.3: bf16[56,64], param_1.3: s32[260,1], param_2.651: f32[216,5,52,64]) -> bf16[56,64] {
  %param_0.3 = bf16[56,64]{1,0} parameter(0)
  %param_1.3 = s32[260,1]{1,0} parameter(1)
  %param_2.651 = f32[216,5,52,64]{3,2,1,0} parameter(2)
  %constant_60_2 = bf16[] constant(0)
  %convert.1433.31 = f32[] convert(bf16[] %constant_60_2)
  %reduce.1316.5 = f32[5,52,64]{2,1,0} reduce(f32[216,5,52,64]{3,2,1,0} %param_2.651, f32[] %convert.1433.31), dimensions={0}, to_apply=%region_26.806.clone.27, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/spec_embed/vmap(vmap(vmap(species_embed)))/reduce_sum[axes=(0,)]" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=38}
  %convert.1518.3 = bf16[5,52,64]{2,1,0} convert(f32[5,52,64]{2,1,0} %reduce.1316.5)
  %bitcast.6432.1 = bf16[260,1,64]{2,0,1} bitcast(bf16[5,52,64]{2,1,0} %convert.1518.3)
  ROOT %scatter.0.1 = bf16[56,64]{1,0} scatter(bf16[56,64]{1,0} %param_0.3, s32[260,1]{1,0} %param_1.3, bf16[260,1,64]{2,0,1} %bitcast.6432.1), update_window_dims={1,2}, inserted_window_dims={}, scatter_dims_to_operand_dims={0}, index_vector_dim=1, to_apply=%region_26.806, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/spec_embed/vmap(vmap(vmap(species_embed)))/species_embed/jit(_take)/scatter-add[update_consts=() dimension_numbers=ScatterDimensionNumbers(update_window_dims=(2,), inserted_window_dims=(0,), scatter_dims_to_operand_dims=(0,)) indices_are_sorted=False unique_indices=False mode=GatherScatterMode.FILL_OR_DROP]" source_file="/home/nicholas/programs/avid/avid/encoder.py" source_line=38}
}

%region_2.176 (Arg_0.177.0: f32[], Arg_1.178.0: f32[]) -> f32[] {
  %Arg_1.178.0 = f32[] parameter(1)
  %Arg_0.177.0 = f32[] parameter(0)
  ROOT %add.166.0 = f32[] add(f32[] %Arg_0.177.0, f32[] %Arg_1.178.0), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_0/reduce_sum[axes=(2,)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%fused_multiply_reduce (param_0.1200: f32[256,52], param_1.1332: f32[], param_2.799: bf16[52], param_3.508: f32[52], param_4.315: f32[1], param_5.294: f32[256,1]) -> (f32[256,1], f32[256,52]) {
  %param_0.1200 = f32[256,52]{1,0} parameter(0)
  %param_3.508 = f32[52]{0} parameter(3)
  %param_4.315 = f32[1]{0} parameter(4)
  %convert.1413.11 = bf16[1]{0} convert(f32[1]{0} %param_4.315), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/convert_element_type[new_dtype=bfloat16 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %bitcast.5084.18 = bf16[] bitcast(bf16[1]{0} %convert.1413.11), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %convert.1540.15 = f32[] convert(bf16[] %bitcast.5084.18)
  %broadcast.631.15 = f32[52]{0} broadcast(f32[] %convert.1540.15), dimensions={}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %add.226.15 = f32[52]{0} add(f32[52]{0} %param_3.508, f32[52]{0} %broadcast.631.15), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %param_2.799 = bf16[52]{0} parameter(2)
  %convert.1415.13 = f32[52]{0} convert(bf16[52]{0} %param_2.799)
  %add.227.13 = f32[52]{0} add(f32[52]{0} %add.226.15, f32[52]{0} %convert.1415.13), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/sub" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %constant_59_1 = bf16[] constant(0.5)
  %convert.1417.13 = f32[] convert(bf16[] %constant_59_1)
  %param_1.1332 = f32[] parameter(1)
  %constant_67_1 = f32[] constant(0.0192307699)
  %multiply.354.15 = f32[] multiply(f32[] %param_1.1332, f32[] %constant_67_1), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/div" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %sqrt.2.15 = f32[] sqrt(f32[] %multiply.354.15), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/sqrt" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %divide.40.13 = f32[] divide(f32[] %convert.1417.13, f32[] %sqrt.2.15), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/div" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %multiply.355.13 = f32[] multiply(f32[] %divide.40.13, f32[] %constant_67_1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/div" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %constant_37_1 = bf16[] constant(2)
  %convert.1418.13 = f32[] convert(bf16[] %constant_37_1)
  %multiply.358.13 = f32[] multiply(f32[] %multiply.355.13, f32[] %convert.1418.13), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/mul" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %broadcast.633.9 = f32[52]{0} broadcast(f32[] %multiply.358.13), dimensions={}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/mul" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %multiply.359.9 = f32[52]{0} multiply(f32[52]{0} %add.227.13, f32[52]{0} %broadcast.633.9), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/mul" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %constant_66_3 = f32[] constant(0.001953125)
  %broadcast.655.3 = f32[52]{0} broadcast(f32[] %constant_66_3), dimensions={}
  %multiply.442.3 = f32[52]{0} multiply(f32[52]{0} %multiply.359.9, f32[52]{0} %broadcast.655.3)
  %broadcast.656.7 = f32[256,52]{1,0} broadcast(f32[52]{0} %multiply.442.3), dimensions={1}
  %multiply.426.7 = f32[256,52]{1,0} multiply(f32[256,52]{1,0} %param_0.1200, f32[256,52]{1,0} %broadcast.656.7)
  %constant_50_7 = f32[] constant(0)
  %reduce.10.5 = f32[256]{0} reduce(f32[256,52]{1,0} %multiply.426.7, f32[] %constant_50_7), dimensions={1}, to_apply=%region_2.176
  %convert.1502.3 = bf16[256]{0} convert(f32[256]{0} %reduce.10.5), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %bitcast.6251.1 = bf16[256,1]{1,0} bitcast(bf16[256]{0} %convert.1502.3)
  %convert.1503.1 = f32[256,1]{1,0} convert(bf16[256,1]{1,0} %bitcast.6251.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %broadcast.634.3.clone.1 = f32[256,52]{1,0} broadcast(f32[52]{0} %multiply.359.9), dimensions={1}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/dot_general[dimension_numbers=(((1,), (1,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %param_5.294 = f32[256,1]{1,0} parameter(5)
  %convert.1411.1.clone.1 = bf16[256,1]{1,0} convert(f32[256,1]{1,0} %param_5.294), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/convert_element_type[new_dtype=bfloat16 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %bitcast.5070.8.clone.1 = bf16[256]{0} bitcast(bf16[256,1]{1,0} %convert.1411.1.clone.1)
  %convert.1539.5.clone.1 = f32[256]{0} convert(bf16[256]{0} %bitcast.5070.8.clone.1)
  %broadcast.651.3.clone.1 = f32[256,52]{1,0} broadcast(f32[256]{0} %convert.1539.5.clone.1), dimensions={0}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/dot_general[dimension_numbers=(((1,), (0,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %multiply.360.3.clone.1 = f32[256,52]{1,0} multiply(f32[256,52]{1,0} %broadcast.634.3.clone.1, f32[256,52]{1,0} %broadcast.651.3.clone.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/dot_general[dimension_numbers=(((1,), (1,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %broadcast.564.1.clone.1 = f32[256,52]{1,0} broadcast(f32[] %constant_66_3), dimensions={}
  %multiply.361.1.clone.1 = f32[256,52]{1,0} multiply(f32[256,52]{1,0} %multiply.360.3.clone.1, f32[256,52]{1,0} %broadcast.564.1.clone.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=250}
  ROOT %tuple.50 = (f32[256,1]{1,0}, f32[256,52]{1,0}) tuple(f32[256,1]{1,0} %convert.1503.1, f32[256,52]{1,0} %multiply.361.1.clone.1)
}

%region_26.806.clone.22 (Arg_0.25.0: f32[], Arg_1.25.0: f32[]) -> f32[] {
  %Arg_1.25.0 = f32[] parameter(1)
  %Arg_0.25.0 = f32[] parameter(0)
  ROOT %add.170.0 = f32[] add(f32[] %Arg_0.25.0, f32[] %Arg_1.25.0), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/vmap(vmap(LazyInMLP_0))/Dense_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
}

%fused_reduce (param_0.1256: f32[], param_1.1333: bf16[52], param_2.800: f32[52], param_3.509: f32[1]) -> f32[1] {
  %param_2.800 = f32[52]{0} parameter(2)
  %param_3.509 = f32[1]{0} parameter(3)
  %convert.1413.5 = bf16[1]{0} convert(f32[1]{0} %param_3.509), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/convert_element_type[new_dtype=bfloat16 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %bitcast.5084.12 = bf16[] bitcast(bf16[1]{0} %convert.1413.5), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %convert.1540.9 = f32[] convert(bf16[] %bitcast.5084.12)
  %broadcast.631.9 = f32[52]{0} broadcast(f32[] %convert.1540.9), dimensions={}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %add.226.9 = f32[52]{0} add(f32[52]{0} %param_2.800, f32[52]{0} %broadcast.631.9), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/vmap(head)/Dense_0/add" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %param_1.1333 = bf16[52]{0} parameter(1)
  %convert.1415.7 = f32[52]{0} convert(bf16[52]{0} %param_1.1333)
  %add.227.7 = f32[52]{0} add(f32[52]{0} %add.226.9, f32[52]{0} %convert.1415.7), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/sub" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %constant_59_3 = bf16[] constant(0.5)
  %convert.1417.7 = f32[] convert(bf16[] %constant_59_3)
  %param_0.1256 = f32[] parameter(0)
  %constant_67_4 = f32[] constant(0.0192307699)
  %multiply.354.9 = f32[] multiply(f32[] %param_0.1256, f32[] %constant_67_4), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/div" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %sqrt.2.9 = f32[] sqrt(f32[] %multiply.354.9), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/sqrt" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %divide.40.7 = f32[] divide(f32[] %convert.1417.7, f32[] %sqrt.2.9), metadata={op_name="jit(loss)/jit(main)/jvp(cond)/branch_1_fun/div" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %multiply.355.7 = f32[] multiply(f32[] %divide.40.7, f32[] %constant_67_4), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/div" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %constant_37_3 = bf16[] constant(2)
  %convert.1418.7 = f32[] convert(bf16[] %constant_37_3)
  %multiply.358.7 = f32[] multiply(f32[] %multiply.355.7, f32[] %convert.1418.7), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/mul" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %broadcast.633.3 = f32[52]{0} broadcast(f32[] %multiply.358.7), dimensions={}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/mul" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %multiply.359.3 = f32[52]{0} multiply(f32[52]{0} %add.227.7, f32[52]{0} %broadcast.633.3), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(cond))/branch_1_fun/mul" source_file="/home/nicholas/programs/avid/avid/config.py" source_line=380}
  %constant_60_25 = bf16[] constant(0)
  %convert.1433.35 = f32[] convert(bf16[] %constant_60_25)
  %reduce.15.5 = f32[] reduce(f32[52]{0} %multiply.359.3, f32[] %convert.1433.35), dimensions={0}, to_apply=%region_26.806.clone.22, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/reduce_sum[axes=(0,)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
  %convert.1499.3 = bf16[] convert(f32[] %reduce.15.5)
  %bitcast.6233.1 = bf16[1]{0} bitcast(bf16[] %convert.1499.3)
  ROOT %convert.1500.1 = f32[1]{0} convert(bf16[1]{0} %bitcast.6233.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/vmap(head)/Dense_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
}

%fused_convert.1 (param_0.21: bf16[256,256]) -> f32[256,8,32] {
  %param_0.21 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6222.1 = bf16[256,8,32]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.21)
  ROOT %convert.1497.1 = f32[256,8,32]{2,1,0} convert(bf16[256,8,32]{2,1,0} %bitcast.6222.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/value/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.2 (param_0.23: bf16[256,256]) -> f32[256,8,32] {
  %param_0.23 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6193.1 = bf16[256,8,32]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.23)
  ROOT %convert.1493.1 = f32[256,8,32]{2,1,0} convert(bf16[256,8,32]{2,1,0} %bitcast.6193.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/query/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.3 (param_0.25: bf16[256,256]) -> f32[8,32,256] {
  %param_0.25 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6169.1 = bf16[8,32,256]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.25)
  ROOT %convert.1490.1 = f32[8,32,256]{2,1,0} convert(bf16[8,32,256]{2,1,0} %bitcast.6169.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/out/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.4 (param_0.27: bf16[256,256]) -> f32[256,8,32] {
  %param_0.27 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6140.1 = bf16[256,8,32]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.27)
  ROOT %convert.1486.1 = f32[256,8,32]{2,1,0} convert(bf16[256,8,32]{2,1,0} %bitcast.6140.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/key/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_reduce.1 (param_0.1195: bf16[26624,256]) -> f32[208,256] {
  %param_0.1195 = bf16[26624,256]{1,0} parameter(0)
  %convert.1425.1 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1195), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.6065.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1425.1)
  %constant_50_2 = f32[] constant(0)
  ROOT %reduce.83.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.6065.1, f32[] %constant_50_2), dimensions={1}, to_apply=%region_2.176, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_reduce.2 (param_0.1240: bf16[26624,256], param_1.1310: bf16[26624,256]) -> f32[208,256] {
  %param_1.1310 = bf16[26624,256]{1,0} parameter(1)
  %convert.1437.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.1310)
  %param_0.1240 = bf16[26624,256]{1,0} parameter(0)
  %convert.1441.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1240)
  %add.237.5 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1437.5, f32[26624,256]{1,0} %convert.1441.5), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.6040.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.237.5)
  %constant_50_47 = f32[] constant(0)
  ROOT %reduce.79.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.6040.1, f32[] %constant_50_47), dimensions={1}, to_apply=%region_2.176, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%fused_convert.5 (param_0.33: bf16[256,256]) -> f32[256,8,32] {
  %param_0.33 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6034.1 = bf16[256,8,32]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.33)
  ROOT %convert.1478.1 = f32[256,8,32]{2,1,0} convert(bf16[256,8,32]{2,1,0} %bitcast.6034.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/value/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.6 (param_0.35: bf16[256,256]) -> f32[256,8,32] {
  %param_0.35 = bf16[256,256]{0,1} parameter(0)
  %bitcast.6005.1 = bf16[256,8,32]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.35)
  ROOT %convert.1474.1 = f32[256,8,32]{2,1,0} convert(bf16[256,8,32]{2,1,0} %bitcast.6005.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/query/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.7 (param_0.37: bf16[256,256]) -> f32[8,32,256] {
  %param_0.37 = bf16[256,256]{0,1} parameter(0)
  %bitcast.5981.1 = bf16[8,32,256]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.37)
  ROOT %convert.1471.1 = f32[8,32,256]{2,1,0} convert(bf16[8,32,256]{2,1,0} %bitcast.5981.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/out/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_convert.8 (param_0.39: bf16[256,256]) -> f32[256,8,32] {
  %param_0.39 = bf16[256,256]{0,1} parameter(0)
  %bitcast.5952.1 = bf16[256,8,32]{2,1,0} bitcast(bf16[256,256]{0,1} %param_0.39)
  ROOT %convert.1467.1 = f32[256,8,32]{2,1,0} convert(bf16[256,8,32]{2,1,0} %bitcast.5952.1), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/key/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_reduce.3 (param_0.1238: bf16[26624,256]) -> f32[208,256] {
  %param_0.1238 = bf16[26624,256]{1,0} parameter(0)
  %convert.1443.1 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1238), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.5877.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1443.1)
  %constant_50_45 = f32[] constant(0)
  ROOT %reduce.69.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.5877.1, f32[] %constant_50_45), dimensions={1}, to_apply=%region_2.176, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_transpose (param_0.600: bf16[26624,256], param_1.547: bf16[26624,256]) -> f32[512,256,52] {
  %param_1.547 = bf16[26624,256]{1,0} parameter(1)
  %convert.1455.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.547)
  %param_0.600 = bf16[26624,256]{1,0} parameter(0)
  %convert.1459.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.600)
  %add.248.3 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1455.3, f32[26624,256]{1,0} %convert.1459.3), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.5859.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.248.3)
  ROOT %transpose.1218.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5859.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%fused_reduce.4 (param_0.1236: bf16[26624,256], param_1.1307: bf16[26624,256]) -> f32[208,256] {
  %param_1.1307 = bf16[26624,256]{1,0} parameter(1)
  %convert.1455.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.1307)
  %param_0.1236 = bf16[26624,256]{1,0} parameter(0)
  %convert.1459.5 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.1236)
  %add.248.5 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1455.5, f32[26624,256]{1,0} %convert.1459.5), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.5848.1 = f32[208,128,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.248.5)
  %constant_50_43 = f32[] constant(0)
  ROOT %reduce.65.1 = f32[208,256]{1,0} reduce(f32[208,128,256]{2,1,0} %bitcast.5848.1, f32[] %constant_50_43), dimensions={1}, to_apply=%region_2.176, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%region_26.806.clone.4 (Arg_0.7.0: f32[], Arg_1.7.0: f32[]) -> f32[] {
  %Arg_1.7.0 = f32[] parameter(1)
  %Arg_0.7.0 = f32[] parameter(0)
  ROOT %add.172.0 = f32[] add(f32[] %Arg_0.7.0, f32[] %Arg_1.7.0), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/vmap(vmap(LazyInMLP_0))/Dense_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
}

%fused_reduce_transpose (param_0.53: bf16[416,512,32]) -> (bf16[8,32,52,512], bf16[52,512,8,32], f32[52,8,32]) {
  %param_0.53 = bf16[416,512,32]{2,1,0} parameter(0)
  %bitcast.5803.3 = bf16[52,8,512,32]{3,2,1,0} bitcast(bf16[416,512,32]{2,1,0} %param_0.53)
  %transpose.1220.1 = bf16[8,32,52,512]{3,2,1,0} transpose(bf16[52,8,512,32]{3,2,1,0} %bitcast.5803.3), dimensions={1,3,0,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1215.1.clone.1 = bf16[52,512,8,32]{3,2,1,0} transpose(bf16[52,8,512,32]{3,2,1,0} %bitcast.5803.3), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %convert.1464.3.clone.1 = f32[52,8,512,32]{3,2,1,0} convert(bf16[52,8,512,32]{3,2,1,0} %bitcast.5803.3)
  %constant_60_7_clone_1 = bf16[] constant(0)
  %convert.1433.5.clone.1 = f32[] convert(bf16[] %constant_60_7_clone_1)
  %reduce.53.1.clone.1 = f32[52,8,32]{2,1,0} reduce(f32[52,8,512,32]{3,2,1,0} %convert.1464.3.clone.1, f32[] %convert.1433.5.clone.1), dimensions={2}, to_apply=%region_26.806.clone.4, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/key/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.24 = (bf16[8,32,52,512]{3,2,1,0}, bf16[52,512,8,32]{3,2,1,0}, f32[52,8,32]{2,1,0}) tuple(bf16[8,32,52,512]{3,2,1,0} %transpose.1220.1, bf16[52,512,8,32]{3,2,1,0} %transpose.1215.1.clone.1, f32[52,8,32]{2,1,0} %reduce.53.1.clone.1)
}

%fused_transpose.1 (param_0.61: bf16[416,32,512]) -> (bf16[8,32,52,512], bf16[52,512,8,32]) {
  %param_0.61 = bf16[416,32,512]{2,1,0} parameter(0)
  %bitcast.5735.3 = bf16[52,8,32,512]{3,2,1,0} bitcast(bf16[416,32,512]{2,1,0} %param_0.61)
  %transpose.1223.1 = bf16[8,32,52,512]{3,2,1,0} transpose(bf16[52,8,32,512]{3,2,1,0} %bitcast.5735.3), dimensions={1,2,0,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1213.1.clone.1 = bf16[52,512,8,32]{3,2,1,0} transpose(bf16[52,8,32,512]{3,2,1,0} %bitcast.5735.3), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.25 = (bf16[8,32,52,512]{3,2,1,0}, bf16[52,512,8,32]{3,2,1,0}) tuple(bf16[8,32,52,512]{3,2,1,0} %transpose.1223.1, bf16[52,512,8,32]{3,2,1,0} %transpose.1213.1.clone.1)
}

%fused_transpose.2 (param_0.65: bf16[26624,256]) -> (bf16[52,8,512,32], bf16[52,8,32,512]) {
  %param_0.65 = bf16[26624,256]{1,0} parameter(0)
  %bitcast.5724.2 = bf16[52,512,8,32]{3,2,1,0} bitcast(bf16[26624,256]{1,0} %param_0.65)
  %transpose.1214.1 = bf16[52,8,512,32]{3,2,1,0} transpose(bf16[52,512,8,32]{3,2,1,0} %bitcast.5724.2), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 2, 3, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1212.1.clone.1 = bf16[52,8,32,512]{3,2,1,0} transpose(bf16[52,512,8,32]{3,2,1,0} %bitcast.5724.2), dimensions={0,2,3,1}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/MultiHeadDotProductAttention_0/out/dot_general[dimension_numbers=(((2,), (2,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.28 = (bf16[52,8,512,32]{3,2,1,0}, bf16[52,8,32,512]{3,2,1,0}) tuple(bf16[52,8,512,32]{3,2,1,0} %transpose.1214.1, bf16[52,8,32,512]{3,2,1,0} %transpose.1212.1.clone.1)
}

%fused_transpose.3 (param_0.396: bf16[26624,256]) -> f32[512,256,52] {
  %param_0.396 = bf16[26624,256]{1,0} parameter(0)
  %convert.1443.2 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.396), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.5612.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1443.2)
  ROOT %transpose.1210.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5612.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_0/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_transpose.4 (param_0.596: bf16[26624,256], param_1.540: bf16[26624,256]) -> f32[512,256,52] {
  %param_1.540 = bf16[26624,256]{1,0} parameter(1)
  %convert.1437.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_1.540)
  %param_0.596 = bf16[26624,256]{1,0} parameter(0)
  %convert.1441.3 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.596)
  %add.237.3 = f32[26624,256]{1,0} add(f32[26624,256]{1,0} %convert.1437.3, f32[26624,256]{1,0} %convert.1441.3), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/query/add_any" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %bitcast.5499.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %add.237.3)
  ROOT %transpose.1208.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5499.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_0/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
}

%region_26.806.clone.14 (Arg_0.17.0: f32[], Arg_1.17.0: f32[]) -> f32[] {
  %Arg_1.17.0 = f32[] parameter(1)
  %Arg_0.17.0 = f32[] parameter(0)
  ROOT %add.176.0 = f32[] add(f32[] %Arg_0.17.0, f32[] %Arg_1.17.0), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/vmap(vmap(LazyInMLP_0))/Dense_0/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/layers.py" source_line=49}
}

%fused_reduce_transpose.1 (param_0.85: bf16[416,512,32]) -> (bf16[8,32,52,512], bf16[52,512,8,32], f32[52,8,32]) {
  %param_0.85 = bf16[416,512,32]{2,1,0} parameter(0)
  %bitcast.5455.3 = bf16[52,8,512,32]{3,2,1,0} bitcast(bf16[416,512,32]{2,1,0} %param_0.85)
  %transpose.1225.1 = bf16[8,32,52,512]{3,2,1,0} transpose(bf16[52,8,512,32]{3,2,1,0} %bitcast.5455.3), dimensions={1,3,0,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1205.1.clone.1 = bf16[52,512,8,32]{3,2,1,0} transpose(bf16[52,8,512,32]{3,2,1,0} %bitcast.5455.3), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...qhd,...khd->...hqk/transpose[permutation=(0, 2, 1, 3)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %convert.1483.3.clone.1 = f32[52,8,512,32]{3,2,1,0} convert(bf16[52,8,512,32]{3,2,1,0} %bitcast.5455.3)
  %constant_60_17_clone_1 = bf16[] constant(0)
  %convert.1433.15.clone.1 = f32[] convert(bf16[] %constant_60_17_clone_1)
  %reduce.57.1.clone.1 = f32[52,8,32]{2,1,0} reduce(f32[52,8,512,32]{3,2,1,0} %convert.1483.3.clone.1, f32[] %convert.1433.15.clone.1), dimensions={2}, to_apply=%region_26.806.clone.14, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/key/reduce_sum[axes=(0, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.36 = (bf16[8,32,52,512]{3,2,1,0}, bf16[52,512,8,32]{3,2,1,0}, f32[52,8,32]{2,1,0}) tuple(bf16[8,32,52,512]{3,2,1,0} %transpose.1225.1, bf16[52,512,8,32]{3,2,1,0} %transpose.1205.1.clone.1, f32[52,8,32]{2,1,0} %reduce.57.1.clone.1)
}

%fused_transpose.5 (param_0.93: bf16[416,32,512]) -> (bf16[8,32,52,512], bf16[52,512,8,32]) {
  %param_0.93 = bf16[416,32,512]{2,1,0} parameter(0)
  %bitcast.5388.3 = bf16[52,8,32,512]{3,2,1,0} bitcast(bf16[416,32,512]{2,1,0} %param_0.93)
  %transpose.1228.1 = bf16[8,32,52,512]{3,2,1,0} transpose(bf16[52,8,32,512]{3,2,1,0} %bitcast.5388.3), dimensions={1,2,0,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1203.1.clone.1 = bf16[52,512,8,32]{3,2,1,0} transpose(bf16[52,8,32,512]{3,2,1,0} %bitcast.5388.3), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.37 = (bf16[8,32,52,512]{3,2,1,0}, bf16[52,512,8,32]{3,2,1,0}) tuple(bf16[8,32,52,512]{3,2,1,0} %transpose.1228.1, bf16[52,512,8,32]{3,2,1,0} %transpose.1203.1.clone.1)
}

%fused_transpose.6 (param_0.97: bf16[26624,256]) -> (bf16[52,8,512,32], bf16[52,8,32,512]) {
  %param_0.97 = bf16[26624,256]{1,0} parameter(0)
  %bitcast.5377.2 = bf16[52,512,8,32]{3,2,1,0} bitcast(bf16[26624,256]{1,0} %param_0.97)
  %transpose.1204.1 = bf16[52,8,512,32]{3,2,1,0} transpose(bf16[52,512,8,32]{3,2,1,0} %bitcast.5377.2), dimensions={0,2,1,3}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 2, 3, 1)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  %transpose.1202.1.clone.1 = bf16[52,8,32,512]{3,2,1,0} transpose(bf16[52,512,8,32]{3,2,1,0} %bitcast.5377.2), dimensions={0,2,3,1}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/MultiHeadDotProductAttention_0/out/dot_general[dimension_numbers=(((2,), (2,)), ((), ())) precision=None preferred_element_type=None]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
  ROOT %tuple.40 = (bf16[52,8,512,32]{3,2,1,0}, bf16[52,8,32,512]{3,2,1,0}) tuple(bf16[52,8,512,32]{3,2,1,0} %transpose.1204.1, bf16[52,8,32,512]{3,2,1,0} %transpose.1202.1.clone.1)
}

%fused_transpose.7 (param_0.397: bf16[26624,256]) -> f32[512,256,52] {
  %param_0.397 = bf16[26624,256]{1,0} parameter(0)
  %convert.1425.2 = f32[26624,256]{1,0} convert(bf16[26624,256]{1,0} %param_0.397), metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.5263.1 = f32[52,512,256]{2,1,0} bitcast(f32[26624,256]{1,0} %convert.1425.2)
  ROOT %transpose.1199.1 = f32[512,256,52]{2,1,0} transpose(f32[52,512,256]{2,1,0} %bitcast.5263.1), dimensions={1,2,0}, metadata={op_name="jit(loss)/jit(main)/transpose(jvp(ViTRegressor))/encoder/encoderblock_1/LayerNorm_1/convert_element_type[new_dtype=float32 weak_type=False]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
}

%fused_multiply_rsqrt (param_0.1279: f32[512,52], param_1.1396: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1279 = f32[512,52]{1,0} parameter(0)
  %constant_35_20 = f32[] constant(0.00390625)
  %broadcast.519.43 = f32[512,52]{1,0} broadcast(f32[] %constant_35_20), dimensions={}
  %multiply.346.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1279, f32[512,52]{1,0} %broadcast.519.43), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %param_1.1396 = f32[512,52]{1,0} parameter(1)
  %multiply.344.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1396, f32[512,52]{1,0} %broadcast.519.43), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %multiply.347.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.344.1.clone.1, f32[512,52]{1,0} %multiply.344.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %subtract.37.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.346.5, f32[512,52]{1,0} %multiply.347.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %constant_50_53 = f32[] constant(0)
  %broadcast.522.49 = f32[512,52]{1,0} broadcast(f32[] %constant_50_53), dimensions={}
  %maximum.20.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.37.3, f32[512,52]{1,0} %broadcast.522.49), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %constant_46_1 = f32[] constant(1e-06)
  %broadcast.524.9 = f32[512,52]{1,0} broadcast(f32[] %constant_46_1), dimensions={}
  %add.223.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.20.11, f32[512,52]{1,0} %broadcast.524.9), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  %bitcast.5039.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.223.5)
  %rsqrt.14.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.5039.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoder_norm/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=228}
  ROOT %tuple.51 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.14.1, f32[512,52]{1,0} %multiply.344.1.clone.1)
}

%fused_multiply_rsqrt.1 (param_0.1280: f32[512,52], param_1.1398: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1280 = f32[512,52]{1,0} parameter(0)
  %constant_35_19 = f32[] constant(0.00390625)
  %broadcast.519.39 = f32[512,52]{1,0} broadcast(f32[] %constant_35_19), dimensions={}
  %multiply.340.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1280, f32[512,52]{1,0} %broadcast.519.39), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %param_1.1398 = f32[512,52]{1,0} parameter(1)
  %multiply.338.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1398, f32[512,52]{1,0} %broadcast.519.39), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %multiply.341.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.338.1.clone.1, f32[512,52]{1,0} %multiply.338.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %subtract.35.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.340.5, f32[512,52]{1,0} %multiply.341.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_50_52 = f32[] constant(0)
  %broadcast.522.53 = f32[512,52]{1,0} broadcast(f32[] %constant_50_52), dimensions={}
  %maximum.19.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.35.3, f32[512,52]{1,0} %broadcast.522.53), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_46_5 = f32[] constant(1e-06)
  %broadcast.524.13 = f32[512,52]{1,0} broadcast(f32[] %constant_46_5), dimensions={}
  %add.219.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.19.11, f32[512,52]{1,0} %broadcast.524.13), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %bitcast.4955.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.219.5)
  %rsqrt.13.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.4955.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_1/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  ROOT %tuple.53 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.13.1, f32[512,52]{1,0} %multiply.338.1.clone.1)
}

%fused_transpose.8 (param_0.131: bf16[416,32,512]) -> bf16[52,512,8,32] {
  %param_0.131 = bf16[416,32,512]{2,1,0} parameter(0)
  %bitcast.4881.1 = bf16[52,8,32,512]{3,2,1,0} bitcast(bf16[416,32,512]{2,1,0} %param_0.131)
  ROOT %transpose.1194.1 = bf16[52,512,8,32]{3,2,1,0} transpose(bf16[52,8,32,512]{3,2,1,0} %bitcast.4881.1), dimensions={0,3,1,2}, metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/MultiHeadDotProductAttention_0/...hqk,...khd->...qhd/transpose[permutation=(0, 3, 1, 2)]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=158}
}

%fused_multiply_rsqrt.2 (param_0.1281: f32[512,52], param_1.1400: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1281 = f32[512,52]{1,0} parameter(0)
  %constant_35_18 = f32[] constant(0.00390625)
  %broadcast.519.35 = f32[512,52]{1,0} broadcast(f32[] %constant_35_18), dimensions={}
  %multiply.333.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1281, f32[512,52]{1,0} %broadcast.519.35), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %param_1.1400 = f32[512,52]{1,0} parameter(1)
  %multiply.331.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1400, f32[512,52]{1,0} %broadcast.519.35), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %multiply.334.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.331.1.clone.1, f32[512,52]{1,0} %multiply.331.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %subtract.32.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.333.5, f32[512,52]{1,0} %multiply.334.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %constant_50_51 = f32[] constant(0)
  %broadcast.522.57 = f32[512,52]{1,0} broadcast(f32[] %constant_50_51), dimensions={}
  %maximum.18.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.32.3, f32[512,52]{1,0} %broadcast.522.57), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %constant_46_4 = f32[] constant(1e-06)
  %broadcast.524.17 = f32[512,52]{1,0} broadcast(f32[] %constant_46_4), dimensions={}
  %add.212.5 = f32[512,52]{1,0} add(f32[512,52]{1,0} %maximum.18.11, f32[512,52]{1,0} %broadcast.524.17), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/add" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  %bitcast.4759.1 = f32[1,512,52]{2,1,0} bitcast(f32[512,52]{1,0} %add.212.5)
  %rsqrt.12.1 = f32[1,512,52]{2,1,0} rsqrt(f32[1,512,52]{2,1,0} %bitcast.4759.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_1/LayerNorm_0/rsqrt" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=156}
  ROOT %tuple.56 = (f32[1,512,52]{2,1,0}, f32[512,52]{1,0}) tuple(f32[1,512,52]{2,1,0} %rsqrt.12.1, f32[512,52]{1,0} %multiply.331.1.clone.1)
}

%fused_multiply_rsqrt.3 (param_0.1282: f32[512,52], param_1.1402: f32[512,52]) -> (f32[1,512,52], f32[512,52]) {
  %param_0.1282 = f32[512,52]{1,0} parameter(0)
  %constant_35_17 = f32[] constant(0.00390625)
  %broadcast.519.31 = f32[512,52]{1,0} broadcast(f32[] %constant_35_17), dimensions={}
  %multiply.325.5 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_0.1282, f32[512,52]{1,0} %broadcast.519.31), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %param_1.1402 = f32[512,52]{1,0} parameter(1)
  %multiply.323.1.clone.1 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %param_1.1402, f32[512,52]{1,0} %broadcast.519.31), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/div" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %multiply.327.3 = f32[512,52]{1,0} multiply(f32[512,52]{1,0} %multiply.323.1.clone.1, f32[512,52]{1,0} %multiply.323.1.clone.1), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/integer_pow[y=2]" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %subtract.30.3 = f32[512,52]{1,0} subtract(f32[512,52]{1,0} %multiply.325.5, f32[512,52]{1,0} %multiply.327.3), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/sub" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_50_49 = f32[] constant(0)
  %broadcast.522.65 = f32[512,52]{1,0} broadcast(f32[] %constant_50_49), dimensions={}
  %maximum.17.11 = f32[512,52]{1,0} maximum(f32[512,52]{1,0} %subtract.30.3, f32[512,52]{1,0} %broadcast.522.65), metadata={op_name="jit(loss)/jit(main)/jvp(ViTRegressor)/encoder/encoderblock_0/LayerNorm_1/max" source_file="/home/nicholas/programs/avid/avid/vit.py" source_line=171}
  %constant_46_2 = f32[] constant(1e-06)
  %broadcast.524.25 = f32[512,52]{1,0} broadcast(f32[] %constant_46_2), dimensions={}
